Revit 2027 API
SiteLocation.Elevation Property
 The elevation of the site location.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Elevation { get; }
Public ReadOnly Property Elevation As Double
	Get
public:
property double Elevation {
	double get ();
}
member Elevation : float with get
Property Value
Double
See Also
Reference
SiteLocation Class
Autodesk.Revit.DB Namespace